List<List> question = [
  ["আপনার কি জ্বর/ কাশি / গলাব্যথা আছে ?", "coughOrThroatPain"],
  ["আপনার কি শ্বাসকষ্ট আছে ?", "problemBreathing"],
  [
    "আপনার প্রতিবেশী বা এলাকার কোন ব্যক্তি কি করোনা ভাইরাসে আক্রান্ত ?",
    "contactWithAnyCOVIDPatient"
  ],
  [
    "আপনার পরিবারের কোন সদস্য কি জ্বর, কাশি, বা শ্বাসকষ্টে আক্রান্ত?",
    "cameInContactWithPersonHavingCoughOrThroatPain"
  ],
  [
    "আপনি কি ডায়াবেটিস, উচ্চ রক্তচাপ, হার্ট ,কিডনী লিভার বা ফুসফুসের কোন রোগ ( এজমা, সিওপিডি), এইচআইভি (এইডস), ক্যান্সার ইত্যাদি রোগে ভুগছেন?",
    "riskGroup"
  ],
  [
    " আপনি কি একজন স্বাস্থ্যকর্মী? (ডাক্তার, নার্স, সহায়ককর্মী ইত্যাদি)",
    "healthCareWorker"
  ],
];
