List<String> question = [
  " আপনার কি জ্বর আছে বা জ্বরজ্বর অনুভব করছেন?",
  "আপনার কি কাশি বা গলাব্যথা বা দুইটাই আছে?",
  "আপনার কি শ্বাসকষ্ট আছে বা শ্বাস নিতে বা ফেলতে কষ্ট হচ্ছে?",
  "আপনি কি বিগত ১৪ দিনের ভিতরে বিদেশ হতে এসেছেন?",
  "আপনি কি বিগত ১৪ দিনের ভিতরে করোনা ভাইরাসে ( কো ভিড-১৯) আক্রান্ত এরকম কোন ব্যক্তির সংস্পর্শে এসেছিলেন? ( একই স্থানে অবস্থান বা ভ্রমন )",
  "আপনি কি বিগত ১৪ দিনে জ্বর, কাশি, শ্বাসকষ্ট আছে এমন কারো সংস্পর্শে এসেছিলেন? (যেমনঃ পরিবার সদস্য / সহকর্মী)",
  "আপনি কি নিম্নের কোন অসুখে ভুগছেন? যেমন : ডায়াবেটিস, উচ্চ রক্তচাপ, হৃদরোগ, এজমা বা হাঁপানি , দীর্ঘমেয়াদি শ্বাসকষ্ট বা সিওপিডি, কিডনি রোগ,লিভার রোগ, এইচআইভি, ক্যান্সার বা ক্যান্সারের জন্য কোন চিকিৎসা নিচ্ছেন ?"
];
